using System;

namespace Home_work_3
{
    class Program
    {
        static void Main(string[] args)
        {
           /*Написать программу, выводящую элементы двухмерного массива по диагонали.


           //Написать программу — телефонный справочник — создать двумерный массив 5*2, хранящий список телефонных контактов: 
           // первый элемент хранит имя контакта, второй — номер телефона/e-mail.


           //Написать программу, выводящую введенную пользователем строку в обратном порядке (olleH вместо Hello).


           //«Морской бой» — вывести на экран массив 10х10, состоящий из символов X и O, где Х — элементы кораблей, а О — свободные клетки.*/

        }
    }
}
